%% @copyright 2014 Takeru Ohta <phjgt308@gmail.com>
%%
%% @doc Log Rotator Interface
%% @private
-module(logi_file_rotator).

%%------------------------------------------------------------------------------------------------------------------------
%% Exported API
%%------------------------------------------------------------------------------------------------------------------------
-export([
         start_link/2,
         stop/1
        ]).

-export_type([
              instance_mfargs/0
             ]).

%%------------------------------------------------------------------------------------------------------------------------
%% Types
%%------------------------------------------------------------------------------------------------------------------------
-type instance_mfargs() :: {module(), Function::atom(), [term()]}.

%%------------------------------------------------------------------------------------------------------------------------
%% Exported Functions
%%------------------------------------------------------------------------------------------------------------------------
%% @doc ログローテートポリシーを管理するプロセスを起動する
-spec start_link(instance_mfargs(), pid()) -> {ok, pid()} | {error, Reason::term()}.
start_link(MFArgs, ParentPid) ->
    {Module, Function, Args} = MFArgs,
    apply(Module, Function, [ParentPid | Args]).

%% @doc プロセスを停止する
-spec stop(pid()) -> ok.
stop(Pid) ->
    _ = exit(Pid, shutdown),
    ok.
